{"keras_version": "1.2.2", "config": [{"config": {"merge_mode": "concat", "name": "bidirectional_1", "batch_input_shape": [null, 20, 27], "trainable": true, "input_dtype": "float32", "layer": {"config": {"dropout_W": 0.0, "activation": "tanh", "stateful": false, "forget_bias_init": "one", "go_backwards": false, "input_dim": null, "output_dim": 256, "trainable": true, "inner_activation": "hard_sigmoid", "U_regularizer": null, "return_sequences": true, "unroll": false, "b_regularizer": null, "inner_init": "orthogonal", "input_length": null, "consume_less": "cpu", "W_regularizer": null, "init": "glorot_uniform", "dropout_U": 0.0, "name": "lstm_1"}, "class_name": "LSTM"}}, "class_name": "Bidirectional"}, {"config": {"merge_mode": "concat", "name": "bidirectional_2", "trainable": true, "layer": {"config": {"dropout_W": 0.0, "activation": "tanh", "stateful": false, "forget_bias_init": "one", "go_backwards": false, "input_dim": null, "output_dim": 64, "trainable": true, "inner_activation": "hard_sigmoid", "U_regularizer": null, "return_sequences": false, "unroll": false, "b_regularizer": null, "inner_init": "orthogonal", "input_length": null, "consume_less": "cpu", "W_regularizer": null, "init": "glorot_uniform", "dropout_U": 0.0, "name": "lstm_2"}, "class_name": "LSTM"}}, "class_name": "Bidirectional"}, {"config": {"input_dim": 128, "activation": "linear", "name": "dense_1", "activity_regularizer": null, "output_dim": 27, "trainable": true, "W_constraint": null, "bias": true, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential"}